<?php
require_once __DIR__ . '/autoloader.php';

$logger = new FileLogger(__DIR__ . '/../tmp/naubade.log');

try {
    $db = DBAccess::connect('localhost', 'u374561970_andrii', '#Jx+u52wR*9', 'u374561970_servicepages');
    $bot_data = $db->select('
        SELECT
            c.value
        FROM config c
        WHERE c.name = ?;',
        ['s' => 'naubade_bot']
    )->fetch_row();
    $bot_data = json_decode($bot_data[0]);
    $bot = new TgBot($bot_data->bot_secret, $logger);
    $bot->debugModeEnable();

    $request = $bot->getUpdate();
    $update = json_decode($request);
    $known_users = json_decode(file_get_contents(__DIR__ . '/../tmp/naubade-users.json'), true);
    $known_users_updated = false;

    if (!empty($update->message)) {
        switch ($update->message->text) {
            case '/start':
                if (empty($known_users[$update->message->from->id])) {
                    $known_users[$update->message->from->id] = $update->message->from;
                    $known_users_updated = true;
                }

                $message = <<<'TXT'
Якщо ви бажаєте:
- вирішувати складні економічні проблеми;
- удосконалити володіння діловою іноземною мовою;
- розвинути лідерські організаційні якості креативного та нестандарт-ного мислення
Тоді ми чекаємо саме на Вас!

Скористайтесь меню нижче, щоб дізнатися більше.
TXT;
                $bot->message($update->message->from)
                    ->addText($message, [
                        ["type" => "bold", "offset" => 192, "length" => 28],
                        ["type" => "italic", "offset" => 192, "length" => 28]
                    ])
                    ->addKeyboard([
                        [['text' => 'Освітні програми'], ['text' => 'Переваги навчання']],
                        [['text' => 'Контакти кафедри'], ['text' => 'Замовити зворотній зв\'язок']],
                    ], true, true)
                    ->send();

                break;
            case 'Освітні програми':
                $message = <<<'TXT'
КАФЕДРА БІЗНЕС-АНАЛІТИКИ ТА ЦИФРОВОЇ ЕКОНОМІКИ
оголошує набір за спеціальністю
051 «ЕКОНОМІКА» 
на освітньо-професійні програми:
TXT;

                $bot->message($update->message->from)
                    ->addText($message, [["type" => "bold", "offset" => 78, "length" => 15]])
                    ->addInlineKeyboard([
                        [['text' => 'ЕКОНОМІЧНА КІБЕРНЕТИКА', 'callback_data' => 'ec']],
                        [['text' => 'ЦИФРОВА ЕКОНОМІКА', 'callback_data' => 'de']],
                        [['text' => 'МІЖНАРОДНА ЕКОНОМІКА', 'callback_data' => 'ie']],
                    ])
                    ->send();

                break;
            case 'Переваги навчання':
                break;
            case 'Контакти кафедри':
                break;
            case 'Замовити зворотній зв\'язок':
                break;
            case '/stop':
                unset($known_users[$update->message->from->id]);
                $known_users_updated = true;

                break;
            default:
                $bot->message($update->message->from)
                    ->addText($update->message->text)
                    ->send();

                break;
        }
    }

    if (!empty($update->callback_query)) {
        switch ($update->callback_query->data) {
            case 'ec':
                $bot->answerCallbackQuery($update->callback_query->id);

                $message = <<<'TXT'
ОСВІТНЬО-ПРОФЕСІЙНА ПРОГРАМА
«ЕКОНОМІЧНА КІБЕРНЕТИКА»

ВСТУПНІ КОНКУРСНІ ПРЕДМЕТИ:
та їх значимість:
1)	Українська мова та література (0,3)
2)	Математика (0,3)
3)	Історія України / іноземна мова / біологія / географія / фізика / хімія (0,3)

Навчаюсь на ОПП «Економічна кібернетика» ви отримаєте кваліфікацію у сфері бізнес-аналізу (Data Scientist), оволодієте навичками організа-ційно-економічного управління, ефективними математичними методами аналізу і прогнозуван-ня економічних процесів з використанням сучас-них інформаційних технологій. 

В ході навчання ви отримаєте знання з дис-циплін: «Моделювання бізнес-процесів», «Еко-номічна кібернетика» «Оптимізаційні методи і моделі», «Введення в бізнес-аналіз», «Програму-вання в економіці», «Теорія ігор в економіці», «Управління проектами», «Cистеми підтримки прийняття рішень», «Ризикологія», «Python для бізнес-аналітика»
Випускники працевлаштовуються у:
Міністерство цифрової трансформації України, Міністерство фінансів України, Державну служ-бу статистики України, Національний банк Ук-раїни, центри соціологічних та маркетингових досліджень, консалтингові агенції та аудиторські компанії, банки, ІТ-компанії, підприємства різ-них форм власності та виробничого спрямування, компанії стільникового зв’язку.
TXT;

                $bot->message($update->callback_query->from->id)
                    ->addText($message)
                    ->addInlineKeyboard([[
                        'text' => 'Повна інформація для абітурієнтів',
                        'url' => 'https://pk.nau.edu.ua/vstup/vstup-na-1-kurs/',
                    ]])
                    ->send();
                break;
            case 'de':
                $bot->answerCallbackQuery($update->callback_query->id);

                $message = <<<'TXT'
ОСВІТНЬО-ПРОФЕСІЙНА ПРОГРАМА
«ЦИФРОВА ЕКОНОМІКА»

ВСТУПНІ КОНКУРСНІ ПРЕДМЕТИ:
та їх значимість:
1)	Українська мова та література (0,3)
2)	Математика (0,3)
3)	Історія України / іноземна мова / біологія / географія / фізика / хімія (0,3)

Навчаюсь на ОПП «Цифрова економіка» ви отримаєте глибокі знання в області сучасних інформаційних технологій, опануєте сучасні програмні продукти інтелектуального аналізу даних, будете визначати перспективні напрями цифровізації та забезпечення кібербезпеки на різних рівнях управління економічними систе-мами. 

В ході навчання ви отримаєте знання з дис-циплін: «Цифрова економіка: цифрова транс-формація середовища і бізнесу»,  «Системний аналіз в економіці», «Електронна комерція», «Інтернет-технології в бізнесі», «Введення в аналіз Big Data», «Web-аналітика та цифровий маркетинг», «Основи машинного навчання» тощо.

Випускники працевлаштовуються у:
провідні ІТ-компанії України та світу, державні установи, Міністерство цифрової трансформації України, Міністерство економічного розвитку та торгівлі України, Національний банк України, науково-дослідні економічні інститути, компанії з управління активами та комерційні банки, страхові компанії та інвестиційні фонди, міжна-родні та вітчизняні промислові підприємства.
TXT;

                $bot->message($update->callback_query->from->id)
                    ->addText($message)
                    ->addInlineKeyboard([[
                        'text' => 'Повна інформація для абітурієнтів',
                        'url' => 'https://pk.nau.edu.ua/vstup/vstup-na-1-kurs/',
                    ]])
                    ->send();
                break;
            case 'ie':
                $bot->answerCallbackQuery($update->callback_query->id);

                $message = <<<'TXT'
ОСВІТНЬО-ПРОФЕСІЙНА ПРОГРАМА
«МІЖНАРОДНА ЕКОНОМІКА»

ВСТУПНІ КОНКУРСНІ ПРЕДМЕТИ:
та їх значимість:
1)	Українська мова та література  (0,3)
2)	Математика (0,25)
3)	Історія України / іноземна мова / біологія / географія / фізика / хімія (0,35)

Навчаюсь на ОПП «Міжнародна економіка» ви здобудете теоретичні знання та практичний досвід щодо роботи посольств, міжнародних ор-ганізацій, представництв міжнародних компаній в Україні, ознайомитеся з історією, культурою, традиціями зарубіжних країн, що лежать в основі їх економічних відносин.

В ході навчання ви отримаєте знання з дис-циплін: «Міжнародна економіка», «Міжнародне економічне право», «Міжнародна торгівля», «Міжнародний маркетинг», «Міжнародні фінан-си», «Міжнародні біржові ринки, «Міжнародний економічний аналіз», «Міжнародні стратегії економічного розвитку» тощо.
Випускники працевлаштовуються у:
державних структурах; міністерствах та відомст-вах, міжнародних організаціях, комерційних підприємствах, фінансових установах (банки, кредитні організації, страхові компанії), авіапід-приємствах (авіакомпаніях та їх іноземних пред-ставництвах, аеропортах, авіапідприємствах), торгівельно-промислові палаті, посольствах, представницьких державних та комерційних ор-ганах за кордоном.
TXT;

                $bot->message($update->callback_query->from->id)
                    ->addText($message)
                    ->addInlineKeyboard([[
                        'text' => 'Повна інформація для абітурієнтів',
                        'url' => 'https://pk.nau.edu.ua/vstup/vstup-na-1-kurs/',
                    ]])
                    ->send();
                break;
            default:
                $bot->answerCallbackQuery($update->callback_query->id);
                break;
        }
    }

    if ($known_users_updated) {
        file_put_contents(__DIR__ . '/../tmp/naubade-users.json', json_encode($known_users));
    }
} catch (Throwable $e) {
    $logger->log($e->getMessage() . PHP_EOL . $e->getTraceAsString() . PHP_EOL);
}

exit;
