<?php

class messages
{
    public static string $welcome_message = <<<'TXT'
Якщо ви бажаєте:
- вирішувати складні економічні проблеми;
- удосконалити володіння діловою іноземною мовою;
- розвинути лідерські організаційні якості креативного та нестандарт-ного мислення
_*Тоді ми чекаємо саме на Вас!*_

Скористайтесь меню нижче, щоб дізнатися більше.
TXT;

    public static string $helpMessage = <<<'TXT'
Цей бот призначений для отримання інформації про освітньо-професійні програми кафедри бізнес-аналітики та цифрової економіки.
Щоб почати роботу, введіть /start
Щоб закінчити роботу, введіть /stop
Щоб знову побачити це повідомлення, введіть /help
TXT;

}